In [13]:
import altair as alt
import pandas as pd
import json
import psycopg2

In [5]:
host = "datavis.cauuh8vzeelb.us-east-1.rds.amazonaws.com"
database = "top5"
user = "teamwonder"
password = ask me

In [8]:
querytext = ("SELECT * FROM tabletop5 " +
             "WHERE complaint_='Air Quality';")

In [22]:
con = psycopg2.connect(host=host, database=database, user=user, password=password)
cur = con.cursor()
cur.execute(querytext)
rows = cur.fetchall()
rows[0]

(2,
 1,
 'Air Quality',
 '10023',
 Decimal('40.776106560588481'),
 Decimal('-73.979744680840554'),
 '2016-03-05',
 '0101000020E6100000F8A80823B47E52C023F8B37557634440')

In [23]:
con.close()

In [15]:
columnname = ['id1','id','type','zipcode','lat','lng','date','geometry']
df = pd.DataFrame(rows, columns=columnname)

,id1,id,type,zipcode,lat,lng,date,geometry
0,2,1,Air Quality,10023,40.776106560588481,-73.979744680840554,2016-03-05,0101000020E6100000F8A80823B47E52C023F8B3755763...
1,11,10,Air Quality,11102,40.770783368051205,-73.933148342619205,2016-03-05,0101000020E61000006E77D3B3B87B52C0530A8707A962...
2,13,12,Air Quality,11420,40.672726713315853,-73.813406236762120,2016-03-05,0101000020E61000005E5008D90E7452C0286BB0E81B56...
3,21,20,Air Quality,10025,40.790329719081015,-73.967512338362368,2016-03-05,0101000020E61000008BEFDEB8EB7D52C0424134862965...
4,23,22,Air Quality,10013,40.716758339844795,-74.008231992789831,2016-03-05,0101000020E61000000CF47ADF868052C06362BEBCBE5B...

In [16]:
df_m = df[['zipcode', 'date']]
df_m.head()

  zipcode        date
0   10023  2016-03-05
1   11102  2016-03-05
2   11420  2016-03-05
3   10025  2016-03-05
4   10013  2016-03-05

In [17]:
df_m.shape

(40896, 2)

In [20]:
casebyzip = df_m.groupby(by='zipcode', as_index=False).count()
casebyzip.columns = ['zipcode','count']
casebyzip.head()

  zipcode  count
0   10000      1
1   10001    508
2   10002    570
3   10003   1100
4   10004    140

In [21]:
casebydate = df_m.groupby(by='date', as_index=False).count()
casebyzip.columns = ['date','count']
casebydate.head()

         date  zipcode
0  2013-01-01        2
1  2013-01-02        8
2  2013-01-03       20
3  2013-01-04       18
4  2013-01-05        5